Revit 2027 API
ExportLineweightInfo.DestinationLineweightName Property
 The destination lineweight name (the name of the line weight in the exported format)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string DestinationLineweightName { get; set; }
Public Property DestinationLineweightName As String
	Get
	Set
public:
property String^ DestinationLineweightName {
	String^ get ();
	void set (String^ value);
}
member DestinationLineweightName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExportLineweightInfo Class
Autodesk.Revit.DB Namespace